Revit 2026 API

# DefinitionGroupsItem Property

---

Retrieve a definition group by name.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DefinitionGroup this[
	string groupName
] { get; }
```
```vb
Public ReadOnly Property Item (
	groupName As String
) As DefinitionGroup
	Get
```
```cpp
public:
property DefinitionGroup^ Item[String^ groupName] {
	DefinitionGroup^ get (String^ groupName);
}
```
```fsharp
member Item : DefinitionGroup with get
```

#### Parameters

groupName String
    The name of the group for which to search.

#### Property Value

DefinitionGroup

If the group is not found then  will be returned.

#### Reference

DefinitionGroups Class

Autodesk.Revit.DB Namespace